# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [33]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [34]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     3
1     3
2     2
3     3
4     3
     ..
95    2
96    2
97    2
98    4
99    3
Length: 100, dtype: int32 0     1
1     1
2     1
3     1
4     2
     ..
95    3
96    1
97    1
98    2
99    3
Length: 100, dtype: int32 0     29042
1     27580
2     19169
3     14350
4     29365
      ...
95    28287
96    28466
97    22326
98    25847
99    14226
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [35]:
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  3  1  29042
1  3  1  27580
2  2  1  19169
3  3  1  14350
4  3  2  29365

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [36]:
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            29042
1      3       1            27580
2      2       1            19169
3      3       1            14350
4      3       2            29365

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [37]:
# join the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       3
1       3
2       2
3       3
4       3
..    ...
95  28287
96  28466
97  22326
98  25847
99  14226

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [38]:
# no, but the length of the DataFrame is 300
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [39]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        3
1        3
2        2
3        3
4        3
..     ...
295  28287
296  28466
297  22326
298  25847
299  14226

[300 rows x 1 columns]